w20_d2/tweeter_app_api/app/controllers/tweets_controller.rb

    def index
        tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

    def show
        tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        tweet = Tweet.new(tweet_params)

        if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "jay's important tweet"], ["content", "stay well"], ["author", "jay"]]

    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tweets" SET "author" = $1 WHERE "tweets"."id" = $2  [["author", "kevin"], ["id", 1]]

    def destroy
        tweet = Tweet.destroy(params[:id])
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 11]]